PlantUML/Usecase/A_AuthenticationAccount/ProfileManagement.plantuml
@startuml
title Use Case Quản lý hồ sơ cá nhân

left to right direction
skinparam shadowing false
actor "Người dùng" as User

rectangle "RoommieMatch" {
  usecase "Xem hồ sơ cá nhân" as ViewProfile
  usecase "Cập nhật thông tin cá nhân" as UpdateProfile
  usecase "Đổi mật khẩu" as ChangePassword
  usecase "Xem thông báo cá nhân" as ViewNotifications
}

User --> ViewProfile
User --> UpdateProfile
User --> ChangePassword
User --> ViewNotifications

UpdateProfile .> ViewProfile : <<include>>
ChangePassword .> ViewProfile : <<include>>

@enduml
